"SPC Password" = "SPC-wachtwoord";
"Authentication Key" = "Identiteitscontrolecode";
"Incorrect key" = "Onjuiste code";
"Incorrect SPC Password" = "Onjuist SPC-wachtwoord";
"Enter 26 digit key" = "Geef de identiteitscontrolecode van 26 cijfers op.";
"Security" = "Beveiliging";
"Too many retries of SPC." = "SPC te vaak opnieuw geprobeerd.";
"AKEY set successfully." = "Instellen van AKEY is geslaagd.";
"Failed to set AKEY." = "Instellen van AKEY is mislukt.";
"Too many retries of AKEY." = "AKEY te vaak opnieuw geprobeerd.";
"Password" = "Wachtwoord";
"Key" = "Code";
"OK" = "OK";
"Cancel" = "Annuleer";